## Datetime

First things, first. Let's import pandas.

In [3]:
import pandas as pd

The file "Google_Stock_Price.csv" contains daily historical stock price data for Google, focusing on the “Open”, "High", "Low" and "Close" prices recorded over several years. Let's store this data in a dataframe and inspect the first 10 rows.

In [46]:
df = pd.read_csv("Google_Stock_Price.csv")
df.head(10)

,symbol,date,open,high,low,close,volume,adjclose,dividends,splits
0,GOOG,2018-01-02,52.417000,53.347000,52.261501,53.250000,24752000,53.059353,0.0,0.0
1,GOOG,2018-01-03,53.215500,54.314499,53.160500,54.124001,28604000,53.930225,0.0,0.0
2,GOOG,2018-01-04,54.400002,54.678501,54.200100,54.320000,20092000,54.125519,0.0,0.0
3,GOOG,2018-01-05,54.700001,55.212502,54.599998,55.111500,25582000,54.914188,0.0,0.0
4,GOOG,2018-01-08,55.111500,55.563499,55.081001,55.347000,20952000,55.148846,0.0,0.0
5,GOOG,2018-01-09,55.470001,55.528500,55.061550,55.313000,18050000,55.114964,0.0,0.0
6,GOOG,2018-01-10,54.855000,55.230000,54.805500,55.130501,20856000,54.933121,0.0,0.0
7,GOOG,2018-01-11,55.314999,55.326248,54.979500,55.276001,19566000,55.078098,0.0,0.0
8,GOOG,2018-01-12,55.120499,56.214500,55.057499,56.112999,34410000,55.912102,0.0,0.0
9,GOOG,2018-01-16,56.625500,56.995499,55.891602,56.088001,31506000,55.887196,0.0,0.0

We see the dataframe contains 10 columns. Let's take a look at the data type of the date in these columns.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1761 entries, 0 to 1760
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   symbol     1761 non-null   object
 1   date       1761 non-null   object
 2   open       1761 non-null   float64
 3   high       1761 non-null   float64
 4   low        1761 non-null   float64
 5   close      1761 non-null   float64
 6   volume     1761 non-null   int64
 7   adjclose   1761 non-null   float64
 8   dividends  1761 non-null   float64
 9   splits     1761 non-null   float64
dtypes: float64(7), int64(1), object(2)
memory usage: 137.7+ KB

We see 7 columns containing floats, one column containing integers and 2 columns containing objects. Pandas displays the data type of Python strings as 'object'. When reading from a csv file (text file), pandas converts the data to integers, floats or strings. This explains why the date-column is represented as a string. Storing dates a strings, limits their usability. Therefore, we want to convert them to datetime objects.

In [ ]:
# Checking the type of the first date
type(df["date"][0])

str

### Converting dates to datetime objects

In [9]:
df["date"] = pd.to_datetime(df["date"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1761 entries, 0 to 1760
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   symbol     1761 non-null   object
 1   date       1761 non-null   datetime64[ns]
 2   open       1761 non-null   float64
 3   high       1761 non-null   float64
 4   low        1761 non-null   float64
 5   close      1761 non-null   float64
 6   volume     1761 non-null   int64
 7   adjclose   1761 non-null   float64
 8   dividends  1761 non-null   float64
 9   splits     1761 non-null   float64
dtypes: datetime64[ns](1), float64(7), int64(1), object(1)
memory usage: 137.7+ KB

Now we see the data type of the date-column has changed to "datetime64[ns]". The reason the data type is not simply 'datetime' is because 'datetime' is already taken by the standard Python library. Without going further into detail, just remember that they are not identical.

In [10]:
df["date"]

0      2018-01-02
1      2018-01-03
2      2018-01-04
3      2018-01-05
4      2018-01-08
          ...
1756   2024-12-24
1757   2024-12-26
1758   2024-12-27
1759   2024-12-30
1760   2024-12-31
Name: date, Length: 1761, dtype: datetime64[ns]

As you know, there are different ways to write a date. "01-05-2025" for most Belgians means May first, so holiday! Let's convert this date to a datetime.

In [15]:
date = pd.to_datetime("01-05-2025")

Let's check the day, month and year.

In [18]:
print("day: ", date.day)
print("month: ", date.month, "month name:", date.month_name())
print("year: ", date.year)

day:  5
month:  1 month name: January
year:  2025

Oops, that's not what we expected. Or is it? Luckily we can provide the [format](https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior) argument when converting dates to datetime objects, to indicate how our date is formatted.

In [22]:
date = pd.to_datetime("01-05-2025", format="%d-%m-%Y")
print("day: ", date.day)
print("month: ", date.month, "month name:", date.month_name())
print("year: ", date.year)
print("-----------------------------")
date = pd.to_datetime("01:05:25", format="%d:%m:%y")
print("day: ", date.day)
print("month: ", date.month, "month name:", date.month_name())
print("year: ", date.year)

day:  1
month:  5 month name: May
year:  2025
-----------------------------
day:  1
month:  5 month name: May
year:  2025

We can also substract dates to calculate the elapsed time between two data entries. The result is a pandas Timedelta.

In [ ]:
date2 = pd.to_datetime("10-05-2025", dayfirst=True)
time_passed = date2-date
time_passed

Timedelta('9 days 00:00:00')

In [33]:
print(time_passed)
print(time_passed.days)
print(time_passed.components)
print(time_passed.components.minutes)

9 days 00:00:00
9
Components(days=9, hours=0, minutes=0, seconds=0, milliseconds=0, microseconds=0, nanoseconds=0)
0

Creating datetime objects from dataframe columns

In [ ]:
data = {"day": ["01", "02", "03"], "month": ["01","01","01"], "year": ["2020", "2020","2020"]}
date_df = pd.DataFrame(data)
date_df

  day month  year
0  01    01  2020
1  02    01  2020
2  03    01  2020

In [ ]:
date_df["date"] = pd.to_datetime(date_df)
date_df

  day month  year       date
0  01    01  2020 2020-01-01
1  02    01  2020 2020-01-02
2  03    01  2020 2020-01-03

## Apply()

Pandas `.apply()` function allows to apply a function to each column (axis= 0 or 'index ) or to each row (axis=1 or 'columns') of a dataframe. 

The function below adds a column 'label' to our stock dataframe based on the opening, closing and highest rate.

In [ ]:
def func(row):
    if row["open"] > row["close"]:
        if row["open"] == row["high"]:
            return "drop"
        else:
            return "downwards"
    elif row["open"] < row["close"]:
        if row["close"] ==  row["high"]:
            return "rise"
        else:
            return "upwards"
    else:
        return "steady"



df["label"] = df.apply(func, axis= 1)
df.head(8)

,symbol,date,open,high,low,close,volume,adjclose,dividends,splits,label
0,GOOG,2018-01-02,52.417000,53.347000,52.261501,53.250000,24752000,53.059353,0.0,0.0,upwards
1,GOOG,2018-01-03,53.215500,54.314499,53.160500,54.124001,28604000,53.930225,0.0,0.0,upwards
2,GOOG,2018-01-04,54.400002,54.678501,54.200100,54.320000,20092000,54.125519,0.0,0.0,downwards
3,GOOG,2018-01-05,54.700001,55.212502,54.599998,55.111500,25582000,54.914188,0.0,0.0,upwards
4,GOOG,2018-01-08,55.111500,55.563499,55.081001,55.347000,20952000,55.148846,0.0,0.0,upwards
5,GOOG,2018-01-09,55.470001,55.528500,55.061550,55.313000,18050000,55.114964,0.0,0.0,downwards
6,GOOG,2018-01-10,54.855000,55.230000,54.805500,55.130501,20856000,54.933121,0.0,0.0,upwards
7,GOOG,2018-01-11,55.314999,55.326248,54.979500,55.276001,19566000,55.078098,0.0,0.0,downwards

#### Other examples

#### Square root

We create a dataframe sq containing 3 rows with the valus 4 and 9.

In [53]:
sq = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
sq

   A  B
0  4  9
1  4  9
2  4  9

Let's create a function sqrt and apply it to the dataframe. We see the square root is taken from all values in the dataframe.

In [ ]:
def sqrt(x):
    return x**(1/2)

sq.apply(sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

#### Sum

In [60]:
sq

   A  B
0  4  9
1  4  9
2  4  9

We can also apply the existing function `sum` (taking the sum of an iterable) along axis = 1, meaning the function is applied to each row. Therefore the row will be the input variable (y) of the function `sum`.

In [ ]:
sq.apply(sum, axis=1)

0    13
1    13
2    13
dtype: int64

This time we apply `sum` along axis = 0, meaning the function is applied to each column. The result will be the sum of every column.

In [ ]:
sq.apply(sum, axis=0)

A    12
B    27
dtype: int64